let handler = async (m, { conn, text}) => {

m.reply(`*╔═══════════════════════════*\n➢ *"${pickRandom(global.piropo)}"*\n*╚═══════════════════════════*`)
}
handler.tags = ['frases']
handler.command = ['комплимент']

export default handler

function pickRandom(list) {
return list[Math.floor(list.length * Math.random())]}

global.piropo = ["Я хотел бы быть бумагой, чтобы я мог обернуть эту конфету.", "Ты как Wi-Fi без пароля, тебя все ищут", "Кто был бы автобусом, чтобы ехать по изгибам твоего сердца.", "Я хочу летать без крыльев и покинуть эту вселенную, войти в твою и любить тебя в тишине.", "Я хотел бы быть маслом, чтобы растаять в твоей арепе.", " Если бы красота была грехом, ты бы уже был в аду, ", "Я Хотел Бы Быть Кошкой, Чтобы Провести Рядом С Тобой 7 Жизней.", "Воровать-Это Неправильно, Но Поцелуй Из Твоих Уст Украл Бы Это У Меня.", "Как Прекрасно Небо, Когда Оно Ясное, Но Еще Прекраснее Любовь, Когда Ты Рядом Со Мной.", "Милая, Иди В Тени, Солнце Тает На Конфетах"," Если Бы Это Было Электронное Письмо, Ты Была Бы Моим Паролем"," Я бы хотел, чтобы ты поехала верхом, чтобы дать тебе мачете", "Я потерял свой номер телефона, не дашь ли ты мне свой?", "Как тебя зовут, чтобы спросить тебя о подарок Деду Морозу?", " На небе много звезд, но самая яркая на Земле, и это ты.", "Только что взошло солнце или это улыбка, которую ты мне подаришь сегодня?", "Дело не в роме или пиве, это ты виноват это пришло мне в голову",]
